<script setup>
import { ref } from 'vue';

const isOpen = ref(false);

const toggleAgreement = () => {
    isOpen.value = !isOpen.value;
};
</script>

<template>
    <span @click="toggleAgreement" class="cursor-pointer text-sm transition-colors duration-300 hover:text-deep-purple-accent-400">Согласие
        на обработку персональных данных</span>
    <div class="bg-white text-center font-ptser fixed overflow-auto z-40 inset-x-0 inset-y-0 w-full h-screen pt-10 px-5 transition-all duration-300 ease-in-out"
        v-if="isOpen">
        <div id="nav-icon-close2" class="text-4xl bg-white w-full h-full">
            <svg @click="toggleAgreement" xmlns="http://www.w3.org/2000/svg" class="w-6 h-6 ml-auto mr-6 cursor-pointer"
                fill="none" viewBox="0 0 24 24" stroke="currentColor" stroke-width="2">
                <path stroke-linecap="round" stroke-linejoin="round" d="M6 18L18 6M6 6l12 12" />
            </svg>
            <h1>Согласие на обработку персональных данных</h1>
            <p class="text-xl text-justify bg-white my-5 pb-5 h-auto">Настоящим в соответствии с Федеральным законом №
                152-ФЗ «О персональных данных» от 27.07.2006 года оставляя заявку на веб-сайте винтернете.рф через форму
                «Напишите какой сайт Вам нужен», действуя свободно, своей волей и в своем интересе выражаю свое
                безусловное согласие на обработку моих персональных данных, зарегистрированным в соответствии с
                законодательством РФ Гибадуллину Р.Р. (radxxx7@mail.ru, +7 919 536-50-56), которому принадлежит веб-сайт
                винтернете.рф (далее по тексту - Оператор).<br>
                1. Согласие дается на обработку одной, нескольких или всех категорий персональных данных, не являющихся
                специальными или биометрическими, предоставляемых мною, которые могут включать:<br>
                - ФИО;<br>
                - Телефон;<br>
                - Комментарий.<br>
                2. Оператор может совершать следующие действия: сбор; запись; систематизация; накопление; хранение;
                уточнение (обновление, изменение); извлечение; использование; блокирование; удаление; уничтожение.<br>
                3. Способы обработки: как с использованием средств автоматизации, так и без их использования.<br>
                4. Цель обработки: предоставление мне услуг/работ, включая, направление в мой адрес уведомлений,
                касающихся предоставляемых услуг/работ, подготовка и направление ответов на мои запросы, направление в
                мой адрес информации о мероприятиях/товарах/услугах/работах Оператора.<br>
                5. В связи с тем, что Оператор может осуществлять обработку моих персональных данных посредством
                электронной почты radxxx7@mail.ru, я даю свое согласие Оператору на осуществление соответствующего
                поручения.<br>
                6. Настоящее согласие действует до момента его отзыва путем направления соответствующего уведомления на
                электронный адрес radxxx7@mail.ru или направления по адресу.<br>
                7. В случае отзыва мною согласия на обработку персональных данных Оператор вправе продолжить обработку
                персональных данных без моего согласия при наличии оснований, предусмотренных Федеральным законом
                №152-ФЗ «О персональных данных» от 27.07.2006 г.
            </p>
        </div>
    </div>
</template>

<style scoped>
/* Добавьте ваши стили здесь */
</style>
